app/controllers/categories_controller.rb

  def index
    @categories = Category.includes(:deals).all
---
SELECT "categories".* FROM "categories"
SELECT "deals".* FROM "deals" WHERE "deals"."category_id" = $1  [["category_id", 1]]

  def show
    @category = Category.includes(:deals).find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "deals".* FROM "deals" WHERE "deals"."category_id" = $1  [["category_id", 1]]

  def create
    @category = current_user.categories.new(categories_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "icon", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"