app/controllers/deals_controller.rb

  def index
    @deals = Deal.all
---
SELECT "deals".* FROM "deals"

  def show
    @deal = Deal.find(params[:id])
---
SELECT "deals".* FROM "deals" WHERE "deals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @deal= current_user.deals.new(deals_params)
    @category = Category.find(deals_params['category_id'])

    respond_to do |format|
      if @deal.save!
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "deals" ("name", "amount", "category_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Food Payment"], ["amount", 550], ["category_id", 1], ["author_id", 1], ["created_at", "2022-04-19 21:11:28.248831"], ["updated_at", "2022-04-19 21:11:28.248831"]]