app/models/deal.rb

SELECT "deals".* FROM "deals"
---
  def self.sum_amounts(deals)
    sum = 0
    deals.all.each do |deal|