app/views/categories/show.html.erb

SELECT "deals".* FROM "deals" WHERE "deals"."category_id" = $1  [["category_id", 2]]
SELECT 1 AS one FROM "deals" WHERE "deals"."category_id" = $1 LIMIT $2  [["category_id", 3], ["LIMIT", 1]]
---
<%= render 'shared/flash'%>
<% if @category.deals.empty? %>

SELECT "deals".* FROM "deals" WHERE "deals"."category_id" = $1  [["category_id", 3]]
---
<% else %>
  <% @category.deals.each do |deal| %>